{
  "datasource": {
    "key": "products",
    "name": "Information about DADI products",
    "sort": { "product": -1 },
    "filter": {},
    "requestParams": [{
      "param": "section", "field": "product"
    }],
    "source": {
      "type": "static",
      "data": [
        {
          "product": "api",
          "color": "#0BA6DD",
          "overview": "High performance RESTful API layer designed in support of API-first development and the principle of COPE"
        },
        {
          "product": "web",
          "color": "#e42918",
          "overview": "High performance schema-less templating layer for browser-based product development"
        },
        {
          "product": "cdn",
          "color": "#e02975",
          "overview": "Just-in-time asset manipulation and delivery layer designed as a modern, global content distribution solution",
          "description": "You can consider a full installation of DADI CDN as being analogous to a traditional CDN (Content Distribution Network) such as Akamai and Limelight. It is designed to carry the processing and delivery load associated with image manipulation and asset delivery (CSS/JS/fonts) and acts autonomously as a layer on top of your core product.\n\nCDN has full support for caching, header control, image manipulation, image compression and image format conversion. An authenticated API allows for fine grained cache control in the form of content invalidation on an individual file or collective path basis.",
          "features": [
            "Built in support for oAuth2",
            "Provides native document versioning at collection level",
            "Supports static endpoints",
            "Includes automatic indexing",
            "Local and networked caching layer",
            "Can be run in a clustered configuration",
            "Search, filter and sort your data with ease",
            "Collection-level access control",
            "Automatic input validation",
            "Support multiple databases connectivity",
            "Automatic database indexing",
            "Cache data responses using a shared Redis layer or the filesystem"
          ],
          "highlights": {
            "title": "The perfect marriage of control, flexibility, and speed.",
            "keyPoints": [
              {
                "title": "Connect",
                "description": "Tell DADI CDN where your files are (no re-uploading required)"
              },
              {
                "title": "Transform",
                "description": "Enhance and adapt your images by building URLs with simple parameters"
              },
              {
                "title": "Deliver",
                "description": "Get images to customers fast with CDN’s intelligent caching and routing"
              }
            ]
          } 
        }
      ]
    }
  }
}